% Part 1 Δημιουργήστε το σήμα

close all           % κλείστε όλες τις γραφικές παραστάσεις
clear all           % καθαρίστε τον χώρο εργασίας
clc                 % καθαρίστε το παράθυρο εντολών 

Fs=500;             % συχνότητα δειγματοληψίας 500 Hz
Ts=1/Fs;            % περίοδος δειγματοληψίας
L=1000;             % μήκος σήματος (αριθμός δειγμάτων)
T=L*Ts;             % διάρκεια σήματος 
t=0:Ts:(L-1)*Ts;    % χρονικές στιγμές υπολογισμού το σήματος
x=sin(2*pi*20*t)+ 0.8*sin(2*pi*70*(t-2)); % ημιτονικό σήμα

% Σχεδιάστε το σήμα στο πεδίο του χρόνου
figure(1)                       % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,x)                       % γραφική παράσταση του σήματος
title('Time domain plot of x')  
% τίτλοςγραφικής παράστασης
xlabel('t (sec)')               % λεζάντα στον άξονα x
ylabel('Amplitude')             % λεζάντα στον άξονα y
pause                           % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
axis([0 0.2 -2 2])              % εμφάνιση του σήματος από 0 έως 0.2 sec και
                                % κλίμακα από -2 έως 2
pause                           % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

% Υπολογίστε τον διακριτό μετασχηματισμό Fourier
N = 2^nextpow2(L);      % μήκος μετασχηματισμού Fourier. 
                        % η nextpow2 βρίσκει τον εκθέτη της δύναμης του 2 που
                        % είναι μεγαλύτερη ή ίση από το όρισμα L
                        % εναλλακτικά, =ceil(log2(L))
Fo=Fs/N;                % ανάλυση συχνότητας
f=(0:N-1)*Fo;           % διάνυσμα συχνοτήτων 
X=fft(x,N);             % αριθμητικός υπολογισμός του διακριτού μετασχηματισμού
                        % Fourier (DFT) για Ν σημεία

% Σχεδιάστε το σήμα στο πεδίο συχνότητας
% Αφού το σήμα είναι πραγματικό μπορείτε
% να σχεδιάσετε μόνο τις θετικές συχνότητες
figure(2)                           % άνοιγμα παραθύρου για γραφική παράσταση
plot(f(1:N-1),abs(X(1:N-1)))        % γραφική παράσταση των θετικών συχνοτήτων   
title('Frequency domain plot of x') % τίτλος γραφικής παράστασης
xlabel('f  (Hz)')                   % λεζάντα στον άξονα x
ylabel('Amplitude')                 % λεζάντα στον άξονα y
pause                               % αναμονή για να δείτε το σχήμα
% πιέστε ένα πλήκτρο για να συνεχίσετε

% για τη γραφική παράσταση του αμφίπλευρου φάσματος
% πρέπει να χρησιμοποιήσετε την fftshift ώστε ο όρος για
% τη συχνότητα μηδέν να μετακινηθεί στην αρχή των αξόνων
% δείτε help fftshift για περισσότερες λεπτομέρειες
figure(3)           % άνοιγμα παραθύρου για γραφική παράσταση
f=f-Fs/2;           % ολίσθηση συχνοτήτων προς τα αριστερά κατά Fs/2
X=fftshift(X);      % ολίσθηση της μηδενικής συχνότητας στο κέντρο του φάσματος                
plot(f,abs(X));title('Two sided spectrum of x'); 
xlabel('f  (Hz)'); 
ylabel('Amplitude') 
pause               
% αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
% Υπολογίστε την ισχύ
power=X.*conj(X)/N/L;       % υπολογισμός πυκνότητας ισχύος
figure(4)                   % άνοιγμα παραθύρου για γραφική παράσταση
plot(f,power)               % ισχύς ανά συνιστώσα συχνότητα
xlabel('Frequency (Hz)')    % λεζάντα στον άξονα x
ylabel('Power')             % λεζάντα στον άξονα y
title('{\bf Periodogram}')  % τίτλος διαγράμματος με παχιά γράμματα
pause

disp('Part2') 

n=randn(1,L);                   % δημιουργία θορύβου
figure(5)                       % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,n)                       % γραφική παράσταση του σήματος
title('Noise')                  % τίτλοςγραφικήςπαράστασης
xlabel('t (sec)')               % λεζάντα στον άξονα x
ylabel('Amplitude')             % λεζάντα στον άξονα y
pause                           % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
axis([0 0.2 -2 2])              % εμφάνιση του σήματος από 0 έως 0.2 sec και
                                % κλίμακα από -2 έως 2
pause                           % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

Nx=fft(n,N);
power_n=Nx .* conj(Nx)/N/L;       % υπολογισμός πυκνότητας ισχύος
figure(6)                     % άνοιγμα παραθύρου για γραφική παράσταση
plot(f,power_n)               % ισχύς ανά συνιστώσα συχνότητα
xlabel('Frequency (Hz)')    % λεζάντα στον άξονα x
ylabel('Power')             % λεζάντα στον άξονα y
title('{\bf Periodogram}')  % τίτλος διαγράμματος με παχιά γράμματα
pause

s=n+x;
figure(7)                       % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,s)                       % γραφική παράσταση του σήματος
title('Signal with noise')      % τίτλοςγραφικήςπαράστασης
xlabel('t (sec)')               % λεζάντα στον άξονα x
ylabel('Amplitude')             % λεζάντα στον άξονα y
axis([0 0.2 -2 2])              % εμφάνιση του σήματος από 0 έως 0.2 sec και
                                % κλίμακα από -2 έως 2
pause                           % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

S=fft(s,N);
S=fftshift(S);
figure(8)
plot(f,abs(S));
title('Two sided spectrum of s'); 
xlabel('f  (Hz)'); 
ylabel('Amplitude');
pause               % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

disp('Part3')

c=sin(2*pi*100*t) .* s;
figure(9)                       % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,c)                       % γραφική παράσταση του σήματος
title('Διαμορφωμένο σήμα')      % τίτλοςγραφικήςπαράστασης
xlabel('t (sec)')               % λεζάντα στον άξονα x
ylabel('Amplitude')             % λεζάντα στον άξονα y
axis([0 0.2 -2 2])              % εμφάνιση του σήματος από 0 έως 0.2 sec και
                                % κλίμακα από -2 έως 2
pause                           % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

C=fft(c,N);
C=fftshift(C);
figure(8)
plot(f,abs(C));
title('Two sided spectrum of c'); 
xlabel('f  (Hz)'); 
ylabel('Amplitude');
pause               % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
